ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV222/ESP32_WordClockV222.ino
constexpr const char* CLOCK_VARIANT =
  #if defined(NL144CLOCK)
    "NL144CLOCK"
  #elif defined(FOURLANGUAGECLOCK)
    "FOURLANGUAGECLOCK"
  #elif defined(NL92CLOCK)
    "NL92CLOCK"
  #elif defined(NLM1M2M3M4L161)
    "NLM1M2M3M4L161"
  #elif defined(DE144CLOCK)
    "DE144CLOCK"
  #elif defined(NLM1M2M3M4L94)
    "NLM1M2M3M4L94"
  #elif defined(NLM1M2M3M4L114)
    "NLM1M2M3M4L114"
  #elif defined(NLM1M2M3M4L144)
    "NLM1M2M3M4L144"
  #elif defined(NLM1M2M3M4L256)
    "NLM1M2M3M4L256"
    #elif defined(NLM1M2M3M4L294)
    "NLM1M2M3M4L294"  
  #elif defined(VIERTALENKLOK)
    "VIERTALENKLOK"
  #else
    "UNKNOWN"
  #endif
;

//------------------------------------------------------------------------------              //
// SPIFFS storage
//--------------------------------------------
Preferences FLASHSTOR;

//------------------------------------------------------------------------------              //
// COLOURS stored in Mem.DisplayChoice
//--------------------------------------------   

const byte DEFAULTCOLOUR = 0;
const byte HOURLYCOLOUR  = 1;          
const byte WHITECOLOR    = 2;
const byte OWNCOLOUR     = 3;
const byte OWNHETISWAS   = 4;
const byte WHEELCOLOR    = 5;
const byte DIGITAL       = 6;
const byte HOURHETISWAS  = 7;
const byte RAINBOW       = 8;
const byte LASTITEM      = 8;                                                                 // Last display choice item number

//------------------------------------------------------------------------------              //
// PIN Assigments for Arduino Nano ESP32
// Use GPIO numbering when compiling with:  By GPIO number (legacy).
//------------------------------------------------------------------------------ 
 
enum DigitalPinAssignments {      // Digital hardware constants ATMEGA 328 ----
 SERRX        = D0,               // Connects to Bluetooth TX
 SERTX        = D1,               // Connects to Bluetooth RX
 encoderPinB  = D2, //5,          // D2 left (labeled CLK on decoder) *** D8 on large PCB !!! no interrupt pin (Use GPIO pin numbering for rotary encoder lib)  
 encoderPinA  = D3, //6,          // D3 right (labeled DT on decoder) on interrupt pin
 clearButton  = D4, //7,          // D4 switch (labeled SW on decoder)
 IRReceiverPin= D4,               // D4 Infrared receiver pin instead of rotary encoder
 LED_PIN      = D5, //8,          // D5 / GPIO 8 Pin to control colour SK6812/WS2812 LEDs (replace D5 with 8 for NeoPixel lib)
 RST_PIN      = 0,                // D2 / GPIO 5 or D6 Reset pin. Stored in Mem.ResetPin. After reset Mem.ResetPin = RST_PIN
 EmptyD6      = D6,               // D6 / GPIO 9 Empty
 EmptyD7      = D7,               // D7 / GPIO 10 Empty
 encoderPinBL = D8,               // D8 *** If large PCB is used change pin D2 to D8 !!
 PCB_LED_D09  = D9,               // D9
 PCB_LED_D10  = D10,              // D10
 secondsPin   = D13 //48,         // D13  GPIO48 (#ifdef LED_BUILTIN  #undef LED_BUILTIN #define LED_BUILTIN 48 #endif)
 };

enum AnaloguePinAssignments {     // Analogue hardware constants ----
 EmptyA0      = A0,               // Empty
 EmptyA1      = A1,               // Empty
 PhotoCellPin = A2,               // LDR pin
 OneWirePin   = A3,               // OneWirePin
 SDA_pin      = A4,               // SDA pin
 SCL_pin      = A5,               // SCL pin
 EmptyA6      = A6,               // Empty
 EmptyA7      = A7};              // Empty
     
//------------------------------------------------------------------------------              //
// LED
//------------------------------------------------------------------------------
extern const uint32_t  NUM_LEDS;                                                              // Defined in Clockfaces.h
                     #ifdef USEEDSOFTLED
EdSoftLED LEDstrip ;                                                                          // Use EdSoftLED 
EdSoftLED LED6812strip = EdSoftLED(NUM_LEDS, LED_PIN, SK6812WGRB);
EdSoftLED LED2812strip = EdSoftLED(NUM_LEDS, LED_PIN, WS2812GRB);
bool UsedEDSOFTLED = true;
                      #else
// LED_PIN = 8;  // bug in Neopixel library. Does not translate D5 to GPIO 8
Adafruit_NeoPixel LEDstrip;
Adafruit_NeoPixel LED6812strip = Adafruit_NeoPixel(NUM_LEDS, LED_PIN, NEO_GRBW + NEO_KHZ800); // NEO_RGBW
Adafruit_NeoPixel LED2812strip = Adafruit_NeoPixel(NUM_LEDS, LED_PIN, NEO_GRB  + NEO_KHZ800); // NEO_RGB NEO_GRB
bool UsedEDSOFTLED = false;
                      #endif
//------------------------------------------------------------------------------
const uint32_t black    = 0x000000, orangered     = 0xFF4000, red        = 0xFF0000, chartreuse   = 0x7FFF00;
const uint32_t brown    = 0x503000, cyberyellow   = 0xFFD300, orange     = 0xFF8000; 
const uint32_t yellow   = 0xFFFF00, cadmiumyellow = 0xFFF600, dyellow    = 0xFFAA00, chromeyellow = 0xFFA700;
const uint32_t green    = 0x00FF00, brightgreen   = 0x66FF00, apple      = 0x80FF00, grass        = 0x00FF80;  
const uint32_t amaranth = 0xE52B50, edamaranth    = 0xFF0050, amber      = 0xFF7E00;
const uint32_t marine   = 0x0080FF, darkviolet    = 0x800080, pink       = 0xFF0080, purple       = 0xFF00FF; 
const uint32_t blue     = 0x0000FF, cerulean      = 0x007BA7, sky        = 0x00FFFF, capri        = 0x00BFFF;
const uint32_t edviolet = 0X7500BC, frenchviolet  = 0X8806CE, coquelicot = 0xFF3800;
const uint32_t greenblue= 0x00F2A0, hotmagenta    = 0xFF00BF, dodgerblue = 0x0073FF, screamingreen= 0x70FF70;
      uint32_t white    = 0xFFFFFF, lgray         = 0x666666, wgray      = 0xAAAAAA;
      uint32_t gray     = 0x333333, dgray         = 0x222222;  

#define CLEARLEDSTARTUP 9999
#define LEDNEARLDR      132

uint32_t MINColor      = chromeyellow;
uint32_t SECColor      = chromeyellow;
  
                                             #if defined FOURLANGUAGECLOCK || defined VIERTALENKLOK
uint32_t DefaultColor  = white;   
uint32_t LetterColor   = white; 
uint32_t UKLetterColor = green; 
uint32_t UKMINColor    = UKLetterColor;
uint32_t UKSECColor    = UKLetterColor;   
uint32_t DELetterColor = red;
uint32_t DEMINColor    = DELetterColor;
uint32_t DESECColor    = DELetterColor; 
uint32_t FRLetterColor = yellow;
uint32_t FRMINColor    = FRLetterColor;
uint32_t FRSECColor    = FRLetterColor; 
uint32_t UKDefaultColor= UKLetterColor;
uint32_t DEDefaultColor= DELetterColor;
uint32_t FRDefaultColor= FRLetterColor;
                                             #else
uint32_t DefaultColor  = chromeyellow;   
uint32_t LetterColor   = chromeyellow;   
                                             #endif //FOURLANGUAGECLOCK

