ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV222/ESP32_WordClockV222.ino
 if (pClient) { NimBLEDevice::deleteClient(pClient); pClient = nullptr; }
 TRhaveFoundAddr    = false;
 TRconnectRequested = false;
 Tekstprintln("TimeReceiver connection failed - restarting scan");
 StartTimeReceiverScan();
}

//--------------------------------------------                                  //
// BLE TimeReceiver Reconnect (loop context only)
//--------------------------------------------
void ReconnectTimeReceiver(void)
{
 if (pClient)
   {
    if (pClient->isConnected()) pClient->disconnect();
    NimBLEDevice::deleteClient(pClient);
    pClient = nullptr;
   }
 TRConnected        = false;
 TRConnecting       = false;
 TRneedsCleanup     = false;                                                    // Clear pending cleanup; doing it now
 TRhaveFoundAddr    = true;                                                     // Keep the found address
 TRconnectRequested = true;
 delay(200);
 Connect_TimeReceiver();
}

//--------------------------------------------                                  //
// BLE TimeReceiver Check client - the single loop-context driver.
// Handles deferred cleanup, connect requests, timeouts and periodic rescan.
//--------------------------------------------
void CheckTimeReceiverClient(void)
{
 unsigned long now = millis();
 NimBLEScan* scan = NimBLEDevice::getScan();

 if (TRneedsCleanup)                                                            // Deferred teardown from onDisconnect (now in loop context)
   {
    TRneedsCleanup = false;
    if (pClient)
      {
       NimBLEDevice::deleteClient(pClient);
       pClient = nullptr;
      }
    if (scan->isScanning()) { scan->stop(); delay(100); }
    delay(200);
    StartTimeReceiverScan();
    return;                                                                     // Resume from clean state next pass
   }

 if (!scan->isScanning() && TimeReceiverRunning)                                // Flag stale - allow rescanning
   {
    TimeReceiverRunning = false;
    Tekstprintln("TimeReceiverRunning flag reset - ready for rescan");
   }

 if (TRconnectRequested && TRhaveFoundAddr && !TRConnected && !TRConnecting)    // Honour a connect request from the scan callback
   {
    TRconnectRequested = false;
    Connect_TimeReceiver();
   }

 if (TRConnecting && (now - TRconnectStartms > CONNECT_TIMEOUT_MS))             // Connection attempt timed out
   {
    if (pClient)
      {
       if (pClient->isConnected()) pClient->disconnect();
       NimBLEDevice::deleteClient(pClient); pClient = nullptr;
      }
    TRConnecting        = false;
    TRhaveFoundAddr     = false;
    TRconnectRequested  = false;
    TimeReceiverRunning = false;
    Tekstprintln("Connect timeout - resetting for new scan");
    StartTimeReceiverScan();                                                    // Use helper so TimeReceiverRunning stays consistent
   }

 if (!TRConnected && !scan->isScanning())                                       // Periodic rescan safety net
   {
    if (now - LastTimeReceiverScan > 3000)
      {
       TimeReceiverRunning = false;
       StartTimeReceiverScan();
       Tekstprintlnf("Periodic rescan initiated (%.1f s since last scan)", (now - LastTimeReceiverScan) / 1000.0);
      }
   }
}




/*
// --------- Time Receiver. Connect to TimeSender TIMESENDER_DEVICE_NAME "BLE-UARTtime"
//--------------------------------------------                                                //
// BLE TimeReceiver client
//--------------------------------------------
void SendMessageTimeReceiver(const char* msg)
{
 if (!TRConnected || !msg || !pRemoteRX || !pClient) return;
 if (!pClient->isConnected()) { TRConnected = false; return; }
 size_t len = strlen(msg);
 pRemoteRX->writeValue((uint8_t*)msg, len, false);
}

//--------------------------------------------                                                //
// BLE TimeReceiver Reconnect time receiver
//--------------------------------------------
void ReconnectTimeReceiver()
{
 if (pClient)                                                                                 // Clean up old client before reconnecting to avoid race condition with onDisconnect callback
   {
    if (pClient->isConnected()) pClient->disconnect();
    NimBLEDevice::deleteClient(pClient);
    pClient = nullptr;
   }
 TRConnected        = false;
 TRConnecting       = false;
 TRhaveFoundAddr    = true;                                                                   // Keep the address
 TRconnectRequested = true;
 delay(200);
 Connect_TimeReceiver();
}
//--------------------------------------------                                                //
// BLE TimeReceiver RX notify callback
// -------------------------------------------
static void TimeReceiverNotifyCB( NimBLERemoteCharacteristic*,  uint8_t* data, size_t len, bool notify)
{
 static char buf[128];
 size_t n = (len < sizeof(buf) - 1) ? len : sizeof(buf) - 1;
 memcpy(buf, data, n);
 buf[n] = 0;
 ReworkInputString(String(buf));
 TRConnectedSince = millis();
}

//--------------------------------------------                                                //
// BLE TimeReceiver Scan callbacks
// Client callbacks
// -------------------------------------------
class TimeReceiverClientCB : public NimBLEClientCallbacks
{
 void onConnect(NimBLEClient* client) override
   {
    TRConnected = true;
    TRConnecting = false;
    TRConnectedSince = millis();
    Tekstprintlnf("TimeReceiver connected to: %s", TIMESENDER_DEVICE_NAME);
   }

 void onDisconnect(NimBLEClient* client, int reason) override
   {
    Tekstprintlnf("TimeReceiver disconnected (reason: %d)", reason); 
    TRConnected        = false;
    TRConnecting       = false;
    TRhaveFoundAddr    = false;
    TRconnectRequested = false;
    TimeReceiverRunning  = false;                                                            // Reset flag
    if (pClient)                                                                             // Clean up client
      {
       NimBLEDevice::deleteClient(pClient);
       pClient = nullptr;
      }
    pRemoteTX = nullptr;
    pRemoteRX = nullptr;
    NimBLEScan* scan = NimBLEDevice::getScan();                                               // Stop any existing scan first
    if (scan->isScanning())  {  scan->stop();   delay(100);  }
    delay(200);
    StartTimeReceiverScan();                                                                  // Start new scan
   }
};

//--------------------------------------------                                                //
// BLE TimeReceiver Scan callbacks
//--------------------------------------------
class TimeReceiverScanCB : public NimBLEScanCallbacks
{
 void onResult(const NimBLEAdvertisedDevice* dev) override
   {
    if (TRConnecting) return;
    if (!dev->haveName()) return;
    std::string rawName = dev->getName();
    if (rawName.find(TIMESENDER_DEVICE_NAME) == std::string::npos) return;
    if (dev->getRSSI() <= TIMERECEIVER_MIN_RSSI) return;
    if (!dev->isConnectable()) return;
    if (!dev->isAdvertisingService(NimBLEUUID(SERVICE_UUID))) return;
    TRfoundAddr        = dev->getAddress();
    TRhaveFoundAddr    = true;
    TRconnectRequested = true;
    NimBLEDevice::getScan()->stop();
   }
};

//--------------------------------------------                                                //
// BLE TimeReceiver Start Time Receiver scan
//--------------------------------------------
void StartTimeReceiverScan(void)
{
 NimBLEScan* scan = NimBLEDevice::getScan();
 if (TimeReceiverRunning && !scan->isScanning())                                              // Reset flag if scan isn't actually running
   {
    TimeReceiverRunning = false;
    Tekstprintln("Flag reset - scan not running");
   }
 if (TimeReceiverRunning)  { Tekstprintln("Scan already running - skipping");   return;}     // Only start if not already running
 if (scan->isScanning()) { scan->stop();  delay(100);}                                        // Stop any existing scan 
 TimeReceiverRunning = true; 
 scan->setActiveScan(true);
 scan->setInterval(160);
 scan->setWindow(30);
 scan->setScanCallbacks(new TimeReceiverScanCB(), true);  // true = delete old callback 
 if (!scan->start(0, false, false))
   {
    Tekstprintln("ERROR: Failed to start TimeReceiver scan");
    TimeReceiverRunning = false;
   }
 else
   {
    LastTimeReceiverScan = millis();
    Tekstprintln("TimeReceiver scan started");
   }
}
//--------------------------------------------                                                //
// BLE TimeReceiver Stop Time Receiver
//--------------------------------------------
void StopTimeReceiver(void)
{
 NimBLEDevice::getScan()->stop();
 if (pClient)
   {
    if (pClient->isConnected()) pClient->disconnect();
    NimBLEDevice::deleteClient(pClient);                                                      // Always delete to avoid memory leak
    pClient = nullptr;
   }
 TRConnected           = false;
 TRConnecting          = false;
 pRemoteTX             = nullptr;
 pRemoteRX             = nullptr;
 TRhaveFoundAddr       = false;
 TRconnectRequested    = false;
}

//--------------------------------------------                                                //
// BLE TimeReceiver Connect TimeReceiver
// -------------------------------------------
static void Connect_TimeReceiver(void)
{
 if (!TRhaveFoundAddr || TRConnected || TRConnecting) return;
 const int MAX_CONNECT_ATTEMPTS = 3;
 const unsigned long POST_DISCONNECT_DELAY_MS = 150;
 
 for (int attempt = 1; attempt <= MAX_CONNECT_ATTEMPTS; ++attempt)
    {
     NimBLEDevice::getScan()->stop();
     delay(100);
     pClient = NimBLEDevice::createClient();
     pClient->setClientCallbacks(new TimeReceiverClientCB(), false);
     TRConnecting      = true;
     TRconnectStartms  = millis();
     
